#include <iostream>
#include<cstdlib>

using namespace std;

int main(void)
{    
  int sp1,sp2,sp3 , fp1,fp2,fp3 , m1,m2,m3, t=0;

  cout <<"Special Prize" << endl;
  cout <<"No1:";
  cin >> sp1 ;
  cout <<"No2:";
  cin >> sp2 ;  
  cout <<"No3:";
  cin >> sp3 ;
  
  cout <<"First Prize" << endl;
  cout <<"No1:";
  cin >> fp1 ;
  cout <<"No2:";
  cin >> fp2 ;  
  cout <<"No3:";
  cin >> fp3 ;
  
  cout <<"My number" << endl;
  cout <<"No1:";
  cin >> m1 ;
  cout <<"No2:";
  cin >> m2 ;  
  cout <<"No3:";
  cin >> m3 ;
  
  //計算獎金 
  
   if (sp1==m1 || sp1==m2 || sp1==m3 || sp2==m1 || sp2==m2 || sp2==m3 || sp3==m1 || sp3==m2 || sp3==m3) 
       t=t+2000000;//和特別獎號碼完全相同，獎金 2000000 元
       
       
   if (fp1==m1 || fp1==m2 || fp1==m3 || fp2==m1 || fp2==m2 || fp2==m3 || fp3==m1 || fp3==m2 || fp3==m3) //和頭獎號碼完全相同，獎金 2000000 元
       t=t+200000; //和頭獎號碼完全相同，獎金 2000000 元
    
    
   if (fp1%10000000 == m1%10000000 || fp1%10000000 == m2%10000000 || fp1%10000000 == m3%10000000) 
       t=t+40000 ; 
       
       else if (fp1%1000000 == m1%1000000 || fp1%1000000 == m2%1000000 || fp1%1000000 == m3%1000000 )
         t=t+10000;
       else if (fp1%100000 == m1%100000 || fp1%100000 == m2%100000 || fp1%100000 == m3%100000 )
         t=t+4000;
       else if (fp1%10000 == m1%10000 || fp1%10000 == m2%10000 || fp1%10000 == m3%10000 )
         t=t+1000;
       else if (fp1%1000 == m1%1000 || fp1%1000 == m2%1000 || fp1%1000 == m3%1000 )
         t=t+200;
       
     if (fp2%10000000 == m1%10000000 || fp2%10000000 == m2%10000000 || fp2%10000000 == m3%10000000) 
       t=t+40000 ; 
       
       else if (fp2%1000000 == m1%1000000 || fp2%1000000 == m2%1000000 || fp2%1000000 == m3%1000000 )
         t=t+10000;
       else if (fp2%100000 == m1%100000 || fp2%100000 == m2%100000 || fp2%100000 == m3%100000 )
         t=t+4000;
       else if (fp2%10000 == m1%10000 || fp2%10000 == m2%10000 || fp2%10000 == m3%10000 )
         t=t+1000;
       else if (fp2%1000 == m1%1000 || fp2%1000 == m2%1000 || fp2%1000 == m3%1000 )
         t=t+200;   
       
     if (fp3%10000000 == m1%10000000 || fp3%10000000 == m2%10000000 || fp3%10000000 == m3%10000000) 
       t=t+40000 ; 
       
       else if (fp3%1000000 == m1%1000000 || fp3%1000000 == m2%1000000 || fp3%1000000 == m3%1000000 )
         t=t+10000;
       else if (fp3%100000 == m1%100000 || fp3%100000 == m2%100000 || fp3%100000 == m3%100000 )
         t=t+4000;
       else if (fp3%10000 == m1%10000 || fp3%10000 == m2%10000 || fp3%10000 == m3%10000 )
         t=t+1000;
       else if (fp3%1000 == m1%1000 || fp3%1000 == m2%1000 || fp3%1000 == m3%1000 )
         t=t+200;    
       
   
    cout <<"Winnings:" << t;
   return 0;
}
